readings = """＜五行＞
木：1
火：0
土：2
金：1
水：4

＜陰陽のバランス＞
陰：2
陽：6

＜月令＞
月令得ず

＜干合＞
年柱天干の「癸」と月柱蔵干の「戊」とが干合
日柱天干の「甲」と年柱蔵干の「己」とが干合

＜支合＞
支合なし

＜三合会局＞
三合会局なし

＜半会＞
申, 子が水半会

＜方合＞
方合なし

＜空亡＞
戌亥

＜七冲＞
七冲なし

＜刑＞
月柱地支の「戌」が、年柱地支の「未」を刑する

＜害＞
年柱地支の「未」と日柱地支の「子」とが害

＜特記＞
特記なし

辛酉 (正官)： 金方合, 害
======
2006年（平成18年）|   3歳 | 丙戌 (食神) |  干合, 刑, 害
2007年（平成19年）|   4歳 | 丁亥 (傷官) |  干合, 害
2008年（平成20年）|   5歳 | 戊子 (偏財) |  干合, 水半会, 害
2009年（平成21年）|   6歳 | 己丑 (正財) |  干合, 支合, 金半会, 冲, 刑
2010年（平成22年）|   7歳 | 庚寅 (偏官) |  冲, 官殺混雑
2011年（平成23年）|   8歳 | 辛卯 (正官) |  支合, 木半会, 冲, 刑
2012年（平成24年）|   9歳 | 壬辰 (偏印) |  支合, 三合水局, 冲
2013年（平成25年）|  10歳 | 癸巳 (印綬) |  干合, 支合, 金半会, 刑
2014年（平成26年）|  11歳 | 甲午 (比肩) |  干合, 支合, 火半会, 冲
2015年（平成27年）|  12歳 | 乙未 (劫財) |  干合, 害

庚申 (偏官)： 水半会
======
2016年（平成28年）|  13歳 | 丙申 (食神) |  水半会
2017年（平成29年）|  14歳 | 丁酉 (傷官) |  干合, 金方合, 害
2018年（平成30年）|  15歳 | 戊戌 (偏財) |  干合, 刑
2019年（令和元年）|  16歳 | 己亥 (正財) |  干合, 害
2020年（令和 2年）|  17歳 | 庚子 (偏官) |  水半会, 害
2021年（令和 3年）|  18歳 | 辛丑 (正官) |  支合, 冲, 刑, 官殺混雑
2022年（令和 4年）|  19歳 | 壬寅 (偏印) |  冲
2023年（令和 5年）|  20歳 | 癸卯 (印綬) |  干合, 支合, 木半会, 刑
2024年（令和 6年）|  21歳 | 甲辰 (比肩) |  干合, 三合水局, 冲
2025年（令和 7年）|  22歳 | 乙巳 (劫財) |  干合, 支合, 刑

己未 (正財)： 干合, 害
======
2026年（令和 8年）|  23歳 | 丙午 (食神) |  支合, 火半会, 冲
2027年（令和 9年）|  24歳 | 丁未 (傷官) |  干合, 害
2028年（令和10年）|  25歳 | 戊申 (偏財) |  干合, 水半会
2029年（令和11年）|  26歳 | 己酉 (正財) |  干合, 金方合, 害
2030年（令和12年）|  27歳 | 庚戌 (偏官) |  刑
2031年（令和13年）|  28歳 | 辛亥 (正官) |  害
2032年（令和14年）|  29歳 | 壬子 (偏印) |  水半会, 害
2033年（令和15年）|  30歳 | 癸丑 (印綬) |  干合, 支合, 冲, 刑
2034年（令和16年）|  31歳 | 甲寅 (比肩) |  干合, 冲
2035年（令和17年）|  32歳 | 乙卯 (劫財) |  干合, 支合, 木半会, 刑

戊午 (偏財)： 干合, 支合, 火半会, 冲
======
2036年（令和18年）|  33歳 | 丙辰 (食神) |  三合水局, 冲
2037年（令和19年）|  34歳 | 丁巳 (傷官) |  干合, 支合, 火方合, 刑
2038年（令和20年）|  35歳 | 戊午 (偏財) |  干合, 支合, 火半会, 冲, 刑
2039年（令和21年）|  36歳 | 己未 (正財) |  干合, 支合, 害
2040年（令和22年）|  37歳 | 庚申 (偏官) |  水半会
2041年（令和23年）|  38歳 | 辛酉 (正官) |  金方合, 害
2042年（令和24年）|  39歳 | 壬戌 (偏印) |  火半会, 刑
2043年（令和25年）|  40歳 | 癸亥 (印綬) |  干合, 害
2044年（令和26年）|  41歳 | 甲子 (比肩) |  干合, 水半会, 天戦地冲, 害
2045年（令和27年）|  42歳 | 乙丑 (劫財) |  干合, 支合, 冲, 刑, 害

丁巳 (傷官)： 干合, 支合, 刑
======
2046年（令和28年）|  43歳 | 丙寅 (食神) |  冲, 刑, 害
2047年（令和29年）|  44歳 | 丁卯 (傷官) |  干合, 支合, 木半会, 刑
2048年（令和30年）|  45歳 | 戊辰 (偏財) |  干合, 三合水局, 冲
2049年（令和31年）|  46歳 | 己巳 (正財) |  干合, 支合, 刑
2050年（令和32年）|  47歳 | 庚午 (偏官) |  支合, 火方合, 火半会, 冲
2051年（令和33年）|  48歳 | 辛未 (正官) |  害
2052年（令和34年）|  49歳 | 壬申 (偏印) |  干合, 支合, 水半会
2053年（令和35年）|  50歳 | 癸酉 (印綬) |  干合, 金方合, 金半会, 害
2054年（令和36年）|  51歳 | 甲戌 (比肩) |  干合, 刑
2055年（令和37年）|  52歳 | 乙亥 (劫財) |  干合, 冲, 害

丙辰 (食神)： 三合水局
======
2056年（令和38年）|  53歳 | 丙子 (食神) |  水半会, 害
2057年（令和39年）|  54歳 | 丁丑 (傷官) |  干合, 支合, 冲, 刑
2058年（令和40年）|  55歳 | 戊寅 (偏財) |  干合, 冲
2059年（令和41年）|  56歳 | 己卯 (正財) |  干合, 支合, 木半会, 刑, 害
2060年（令和42年）|  57歳 | 庚辰 (偏官) |  水半会, 冲, 刑
2061年（令和43年）|  58歳 | 辛巳 (正官) |  干合, 支合, 刑
2062年（令和44年）|  59歳 | 壬午 (偏印) |  支合, 火半会, 冲
2063年（令和45年）|  60歳 | 癸未 (印綬) |  干合, 害
2064年（令和46年）|  61歳 | 甲申 (比肩) |  干合, 水半会
2065年（令和47年）|  62歳 | 乙酉 (劫財) |  干合, 支合, 金方合, 害

乙卯 (劫財)： 干合, 支合, 木半会, 刑
======
2066年（令和48年）|  63歳 | 丙戌 (食神) |  支合, 刑
2067年（令和49年）|  64歳 | 丁亥 (傷官) |  干合, 三合木局, 害
2068年（令和50年）|  65歳 | 戊子 (偏財) |  干合, 水半会, 害
2069年（令和51年）|  66歳 | 己丑 (正財) |  干合, 支合, 冲, 刑
2070年（令和52年）|  67歳 | 庚寅 (偏官) |  干合, 冲
2071年（令和53年）|  68歳 | 辛卯 (正官) |  支合, 木半会, 刑
2072年（令和54年）|  69歳 | 壬辰 (偏印) |  三合水局, 冲, 害
2073年（令和55年）|  70歳 | 癸巳 (印綬) |  干合, 支合, 刑
2074年（令和56年）|  71歳 | 甲午 (比肩) |  干合, 支合, 火半会, 冲
2075年（令和57年）|  72歳 | 乙未 (劫財) |  干合, 木半会, 害

甲寅 (比肩)： 干合, 冲
======
2076年（令和58年）|  73歳 | 丙申 (食神) |  水半会, 冲
2077年（令和59年）|  74歳 | 丁酉 (傷官) |  干合, 金方合, 害
2078年（令和60年）|  75歳 | 戊戌 (偏財) |  干合, 刑
2079年（令和61年）|  76歳 | 己亥 (正財) |  干合, 支合, 害
2080年（令和62年）|  77歳 | 庚子 (偏官) |  水半会, 害
2081年（令和63年）|  78歳 | 辛丑 (正官) |  支合, 冲, 刑
2082年（令和64年）|  79歳 | 壬寅 (偏印) |  冲
2083年（令和65年）|  80歳 | 癸卯 (印綬) |  干合, 支合, 木半会, 刑
2084年（令和66年）|  81歳 | 甲辰 (比肩) |  干合, 三合水局, 冲
2085年（令和67年）|  82歳 | 乙巳 (劫財) |  干合, 支合, 刑, 害

癸丑 (印綬)： 干合, 支合, 冲, 刑
======
2086年（令和68年）|  83歳 | 丙午 (食神) |  支合, 火半会, 冲, 害
2087年（令和69年）|  84歳 | 丁未 (傷官) |  干合, 冲, 害
2088年（令和70年）|  85歳 | 戊申 (偏財) |  干合, 水半会
2089年（令和71年）|  86歳 | 己酉 (正財) |  干合, 金方合, 金半会, 害
2090年（令和72年）|  87歳 | 庚戌 (偏官) |  刑
2091年（令和73年）|  88歳 | 辛亥 (正官) |  水方合, 害
2092年（令和74年）|  89歳 | 壬子 (偏印) |  支合, 水半会, 害
2093年（令和75年）|  90歳 | 癸丑 (印綬) |  干合, 支合, 冲, 刑
2094年（令和76年）|  91歳 | 甲寅 (比肩) |  干合, 冲
2095年（令和77年）|  92歳 | 乙卯 (劫財) |  干合, 支合, 木半会, 刑

壬子 (偏印)： 水半会, 害
======
2096年（令和78年）|  93歳 | 丙辰 (食神) |  三合水局, 冲
2097年（令和79年）|  94歳 | 丁巳 (傷官) |  干合, 支合, 刑
2098年（令和80年）|  95歳 | 戊午 (偏財) |  干合, 支合, 火半会, 冲
2099年（令和81年）|  96歳 | 己未 (正財) |  干合, 害
2100年（令和82年）|  97歳 | 庚申 (偏官) |  水半会
2101年（令和83年）|  98歳 | 辛酉 (正官) |  金方合, 害
2102年（令和84年）|  99歳 | 壬戌 (偏印) |  刑
2103年（令和85年）| 100歳 | 癸亥 (印綬) |  干合, 害
2104年（令和86年）| 101歳 | 甲子 (比肩) |  干合, 水半会, 害
2105年（令和87年）| 102歳 | 乙丑 (劫財) |  干合, 支合, 冲, 刑

辛亥 (正官)： 害
======
2106年（令和88年）| 103歳 | 丙寅 (食神) |  干合, 支合, 冲
2107年（令和89年）| 104歳 | 丁卯 (傷官) |  干合, 支合, 三合木局, 刑
2108年（令和90年）| 105歳 | 戊辰 (偏財) |  干合, 三合水局, 冲
2109年（令和91年）| 106歳 | 己巳 (正財) |  干合, 支合, 冲, 刑
2110年（令和92年）| 107歳 | 庚午 (偏官) |  支合, 火半会, 冲, 官殺混雑
2111年（令和93年）| 108歳 | 辛未 (正官) |  害
2112年（令和94年）| 109歳 | 壬申 (偏印) |  水半会, 害
2113年（令和95年）| 110歳 | 癸酉 (印綬) |  干合, 金方合, 害
2114年（令和96年）| 111歳 | 甲戌 (比肩) |  干合, 刑
2115年（令和97年）| 112歳 | 乙亥 (劫財) |  干合, 刑, 害

庚戌 (偏官)： 刑
======
2116年（令和98年）| 113歳 | 丙子 (食神) |  水半会, 害
2117年（令和99年）| 114歳 | 丁丑 (傷官) |  干合, 支合, 冲, 刑
2118年（令和100年）| 115歳 | 戊寅 (偏財) |  干合, 冲
2119年（令和101年）| 116歳 | 己卯 (正財) |  干合, 支合, 木半会, 刑
2120年（令和102年）| 117歳 | 庚辰 (偏官) |  三合水局, 冲
2121年（令和103年）| 118歳 | 辛巳 (正官) |  支合, 刑, 官殺混雑
2122年（令和104年）| 119歳 | 壬午 (偏印) |  支合, 火半会, 冲

----
月支蔵干：偏財、月柱天干：偏印
偏財が偏印を剋します。地星が天星を剋す逆剋の形ですが、偏印は制御を受けないと、とりとめのつきにくい通変星なので、この剋はかえってプラスです。強い偏財に制されて、一つ のことに粘り強く取り組む姿勢が生まれます。このタイプは基本的には真面目で控えめです。地味で実直、口数は少なく、ときに話し下手で損をしやすいタイプが少なくありません。 何を考えているかわからないようなところがあるため、とっつきはよくありませんが、ひとたび打ち解けると、義理人情に篤く、信頼のおける人物だということが分かります。とっつ きの悪さは、照れ屋でスタンドプレーを嫌う気質に由来することが多いようです。独自の個性とスタイルを大切にする人で、情緒的なため誤解されやすい一面がありますが、確固たる 地位を築く力、かなり大きなトップ運があります。母親と縁が薄いか、父が力にならない暗示があります。粘り強いタイプです。頭の回転が速く、器用さもあるので、いろいろな場面 で重宝される人材となる可能性があります。アピールに不足するところがありますが、独自のスタイルで立場をキープできるでしょう。"""
